---
kind: enumMember
id: F:Autodesk.Revit.DB.PointOnCurveMeasurementType.SegmentLength
enum: Autodesk.Revit.DB.PointOnCurveMeasurementType
source: html/8bd00c68-1bcd-9bc9-c246-0f0c96962146.htm
---
# Autodesk.Revit.DB.PointOnCurveMeasurementType.SegmentLength

Length of the curve segment between the start point and the given point.